{
  "Header": {
    "search": "Пошук",
    "viewMap": "Переглянути на мапі",
    "viewList": "Переглянути списком",
    "toggleViewMode": "Переключити вигляд",
    "toggleLanguage": "Змінити мову",
    "toggleTheme": "Змінити тему",
    "toggleSearch": "Відкрити пошук"
  },
  "Map": {
    "expandMap": "Розгорнути мапу",
    "collapseMap": "Згорнути мапу",
    "searchPlaceholder": "Пошук",
    "geoErrorTitle": "Помилка геолокації",
    "geoErrorClose": "Закрити",
    "stores": "Панорами",
    "memories": "Спогади",
    "coordinates": "Координати:",
    "latitude": "Широта:",
    "longitude": "Довгота:",
    "inputTitle": "Введіть назву",
    "inputAddress": "Введіть адресу",
    "address": "Адреса:",
    "createPoint": "Визначити місце"
  },
  "SvitloCherga": {
    "title": "Графік погодинних відключень",
    "description": "Сервіс оповіщення про акуальні графіки погодинних відключень та розподілення електроенергії відповідно визначених черг по областям",
    "sourceData": "Джерело даних:",
    "selectRegion": "Оберіть область",
    "update": "Оновити",
    "date": "Дата:",
    "next": " Наступна:",
    "electricityDown": "Електроенергія відсутня",
    "electricityUp": "Електроенергія розподіляється",
    "electricityUnknown": "Може бути відсутня / немає даних",
    "loading": "Завантаження...",
    "selectRegionChart": "Оберіть область для відображення графіку",
    "chartTitle": "Графік відключень по чергах",
    "noShedule": "Графік відсутній для обраної області",
    "noData": "(графік не опубліковано)",
    "queue": "Черга",
    "statistics": "Статистика відключень",
    "hours": "Прогнозована тривалість відключень за добу:",
    "hoursShort": "год",
    "percentage": "Частка відключених годин у черзі:",
    "today": "Сьогодні",
    "tomorrow": "Завтра",
    "legend": "Легенда",
    "allQueues": "Всі черги"
  },
  "Stores": {
    "collapse": "Згорнути панорами",
    "expand": "Розгорнути панорами",
    "created": "Створено:",
    "updated": "Оновлено:",
    "shootingDate": "Дата зйомки:",
    "see": "Переглянути",
    "address": "Адреса:",
    "contacts": "Контакти:",
    "workingHours": "Години роботи:",
    "createdAt": "Створено:",
    "updatedAt": "Оновлено:",
    "backToMap": "Назад до мапи",
    "backToList": "Назад до списку",
    "addressNotAvailable": "Адрес не указан",
    "description": "Опис:",
    "back": "Назад",
    "forward": "Вперед",
    "loading": "Завантаження магазинів...",
    "type": "Тіп: ",
    "rating": "Рейтинг:",
    "goods": "Наші товари та акції",
    "goodsName": "Назва товару ",
    "price": "Ціна",
    "status": "Статус",
    "promoPrice": "Акційна ціна",
    "startPromo": "Початок акції",
    "endPromo": "Закінчення акції",
    "goodsPhoto": "Фото товару",
    "goodsSearch": "Пошук по назві",
    "promo": "Акція",
    "ended": "Закінчена",
    "notStarted": "Не почалася",
    "platform": " - LocalHub Старокостянтинів"
  },
  "Footer": {
    "title": "LocalHub - Старокостянтинів",
    "terms": "Умови використання",
    "policy": "Політика конфіденційності",
    "howToHelp": "Як допомогти",
    "developer": "Розроблено IT-Starkon",
    "copyright": "© 2025. Всі права захищено.",
    "services": "Послуги",
    "ukraineSupport": "Разом відновимо Україну",
    "info": "Інформація",
    "description": "Соціальна платформа для розвитку місцевої економіки, підтримки підприємництва в Україні та місцевих жителів. Разом будуємо сильні громади та відновлюємо Україну.",
    "slogan": "Сильний бізнес - сильні громади",
    "navigation": "Навігація",
    "home": "Головна",
    "businesses": "Підприємства",
    "support": "Підтримка",
    "sourceInfo": "Де LocalHub бере інформацію",
    "followUs": "Слідкуйте за нами: ",
    "howToAddInfo": "Як додати інформацію",
    "about": "Про платформу",
    "akordeonTitle": "Сайт LocalHub Старокостянтинів",
    "akordeonText1": "Це інноваційна гіперлокальна платформа для мешканців і підприємців міста та Хмельницької області.",
    "akordeonText2": " Вона допомагає жителям швидко знаходити потрібні послуги поруч, а бізнесу – отримувати нових клієнтів. Частина доходу від платних сервісів спрямовується на соціальні проєкти з підтримки внутрішньо переміщених осіб.",
    "akordeonText3": "LocalHub поєднує сучасні технології, аналітику та соціальну відповідальність, створюючи єдину екосистему для громади."
  },
  "ShareButtons": {
    "sharedSocial": "Поділитись через соціальні мережі"
  },
  "DonationServiceTerms": {
    "title": "Умови публічної оферти платформи LocalHub",
    "contractTitle": "ДОГОВІР публічної оферти про надання благодійної пожертви",
    "description": "Ця публічна оферта (надалі – «Оферта») адресована невизначеному колу осіб – фізичним та юридичним особам (надалі – «Благодійник»), що є відвідувачами сайту https://localhub.store (надалі – «Сайт»). Оферта є офіційною і публічною пропозицією Благодійної організації «Благодійний фонд соціальних реформ та підтримки «Надія» (код ЄДРПОУ 26220897), в особі директора Мелешка Олександра Миколайовича, який діє на підставі Статуту (надалі – «Фонд»), укласти договір про надання благодійної пожертви (надалі – «Договір») на умовах, викладених нижче.",

    "definitionTitle": "1. Терміни та визначення",
    "definition1": [
      "Публічна оферта (Оферта)",
      " – дійсна пропозиція Фонду, розміщена на Сайті, про надання благодійної пожертви, адресована необмеженому колу осіб."
    ],
    "definition2": [
      "Акцепт",
      " – повне і безумовне прийняття умов Оферти шляхом здійснення грошового переказу за допомогою платіжних засобів, доступних на Сайті, або шляхом перерахування коштів на розрахунковий рахунок Фонду."
    ],
    "definition3": [
      "Благодійна пожертва",
      " – безоплатна передача Благодійником коштів у власність Фонду для подальшого використання з метою реалізації програм LocalHub та інших статутних завдань Фонду."
    ],
    "definition4": [
      "Благодійник",
      " – фізична або юридична особа, яка добровільно здійснила благодійну пожертву та акцептувала цю Оферту."
    ],

    "subjectTitle": "2. Предмет договору",
    "subjectDescription1": "2.1. Предметом цього Договору є добровільна та безоплатна передача Благодійником у власність Фонду грошових коштів у вигляді благодійної пожертви для підтримки та розвитку платформи LocalHub Старокостянтинів, зокрема: розвитку цифрових сервісів для підприємців громади, підтримки внутрішньо переміщених осіб (ВПО), сприяння зайнятості та самозайнятості, розвитку локальних бізнесів, культурних та освітніх ініціатив.",
    "subjectDescription2": "2.2. Благодійник самостійно визначає розмір та призначення своєї благодійної пожертви.",
    "subjectDescription3": "2.3. Благодійні пожертви не мають на меті отримання прибутку Благодійником чи Фондом і спрямовуються виключно на реалізацію статутної діяльності Фонду та програм LocalHub.",

    "contactsTitle": "11. Реквізити Фонду",
    "fondName": "Благодійний фонд соціальних реформ та підтримки «Надія»",
    "edrpou": "ЄДРПОУ 26220897",
    "address": "386065, Україна, Донецька область, м. Авдіївка, вул. Нечаєва, 16",
    "bankName": "АТ «ПриватБанк»",
    "bankAccount": "р/р UA813354960000026007051602289",
    "director": "Директор: Мелешко Олександр"
  },
  "HowToHelp": {
    "title": "Як допомогти",
    "intro2": "LocalHub Старокостянтинів — платформа для підтримки місцевої економіки, об’єднання громади та нових можливостей для бізнесу",
    "intro": "LocalHub Старокостянтинів — це платформа, яка допомагає підтримувати та розвивати місцеву економіку в умовах воєнного стану, об’єднувати громаду та створювати нові можливості для підприємців і жителів. Ваша участь зробить наш спільний простір сильнішим та кориснішим!",
    "volonters": "Ми шукаємо волонтерів!",
    "volontersDescription": "Нам потрібні активні люди, які допоможуть розвивати платформу та робити її зручнішою для мешканців, підприємців та гостей міста. Ви можете обрати напрям, де ваші знання та досвід будуть найкориснішими для громади:",
    "designers": [
      "Дизайнери",
      " — для покращення візуального стилю та створення привабливого простору для користувачів."
    ],
    "QA": ["Тестувальники", " — для перевірки функціоналу додатку та забезпечення якісної роботи сервісів."],
    "lawyers": [
      "Юристи",
      " — для підготовки корисних матеріалів для підприємців, ВПО та мешканців громади (договори, консультації, довідники)."
    ],
    "ngos": [
      "Представники громадських організацій",
      " — для спільного створення соціальних і бізнесових проєктів, що підсилюють локальну економіку та підтримують ВПО."
    ],
    "ifYouStarterText": "Навіть якщо ви початківець, але хочете розвиватись і робити внесок у розвиток громади — пишіть нам: ",
    "ifYouStarterAfterLink": ". Це гарна можливість отримати досвід роботи над реальним проєктом і стати частиною змін у місті.",
    "supportTitle": "Фінансова підтримка",
    "supportDescription": "Кошти, які ми отримуємо, йдуть на технічну підтримку, просування та запуск нових функцій, корисних для користувачів і громади. А також на реалізацію соціальних проектів з підтримки ВПО. Навіть невеликий внесок допоможе нам рости швидше а платформі бути ефективніше!",

    "joinTitle": "Партнерство та співпраця",
    "joinDescriptionText": "Ми відкриті до співпраці з підприємцями, громадськими організаціями та активними жителями. Якщо ви хочете долучитись або запропонувати партнерство — зв'яжіться з нами ",
    "joinDescriptionAfterLink": ". Разом ми можемо створити платформу, яка стане рушієм розвитку громади.",
    "aboutCompany": ["Ініціатор проєкту: ", "Благодійний фонд соціальних реформ та підтримки «Надія»"]
  },
  "PrivacyPolicy": {
    "title": "Політика конфіденційності",
    "subTitle": "LocalHub Старокостянтинів — платформа для громади та місцевого бізнесу",
    "fundName": "Ініціатор та оператор: Благодійний фонд соціальних реформ та підтримки «Надія»",
    "ourSite": "Офіційний сайт платформи:",

    "collectInfoTitle": "Які дані ми збираємо та навіщо",
    "collectInfoDescription": "Ми обробляємо лише мінімально необхідні дані для роботи сервісу LocalHub: облікові дані зареєстрованих користувачів (ім’я, електронна пошта), профілі бізнесів доступні з відкритих джерел (назва, опис, контакти, адреса, категорії, графік), геодані точок на мапі (координати), контент, який ви добровільно публікуєте (акції, зображення, прайси, посилання). Якщо оформлюєте платні послуги, оплати обробляє платіжний провайдер; ми зберігаємо лише факт оплати та ідентифікатор операції. Якщо надаєте дозвіл у браузері, ми тимчасово обробляємо приблизні координати вашого розташування для функції «поруч» — ці дані не зберігаються. Дані використовуються для відображення каталогу та мапи, пошуку й рекомендацій, покращення якості сервісу, зв’язку з вами та виконання юридичних зобов’язань.",

    "cookieTitle": "Файли cookie та подібні технології",
    "cookieDescription": "Ми використовуємо cookie трьох типів: (1) необхідні — для входу, налаштувань мови та безпеки; (2) функціональні — для збереження ваших уподобань (наприклад, фільтри каталогу); (3) аналітичні — для вимірювання відвідуваності та покращення сервісу у знеособленому вигляді. Ви можете керувати cookie у налаштуваннях браузера; відключення необхідних cookie може обмежити роботу сайту.",

    "anotherTitle": "Сторонні сервіси та посилання",
    "anotherDescription": "Платформа може містити посилання на сайти бізнесів і підключати сторонні сервіси (наприклад, карти, віртуальні тури, платіжні провайдери). Політики конфіденційності третіх сторін нами не контролюються — радимо ознайомлюватися з ними окремо. Перед переданням даних третім сторонам ми дотримуємося принципу мінімізації.",

    "dataTitle": "Зберігання, безпека та строки",
    "dataDescription": "Ми застосовуємо технічні й організаційні заходи безпеки: шифрування з’єднань (HTTPS), розмежування доступів, резервне копіювання. Персональні дані зберігаються не довше, ніж це потрібно для цілей обробки або передбачено законом. Публічні профілі бізнесів та акції зберігаються доти, доки власник їх підтримує або це необхідно для інтересів громади. Обліковий запис можна видалити за запитом.",

    "rightsTitle": "Ваші права",
    "rightsDescription": "Ви маєте право: (1) доступу до своїх даних; (2) виправлення неточностей; (3) видалення («право бути забутим») за відсутності законних підстав для збереження; (4) обмеження обробки; (5) заперечення проти обробки; (6) перенесення даних. Також ви можете відкликати згоду, якщо обробка ґрунтується на згоді. Щоб реалізувати права — зв’яжіться з нами електронною поштою.",

    "changeTitle": "Оновлення політики",
    "changeDescription": "Ми періодично оновлюємо цю політику у разі зміни сервісів або законодавства. Актуальна версія завжди доступна на цій сторінці; про істотні зміни ми можемо повідомляти у сервісі.",

    "contactsTitle": "Контакти",
    "contactsDescription": "З питань обробки персональних даних звертайтесь на електронну пошту:"
  },
  "GeoError": {
    "title": "Помилка:",
    "description": "Для отримання доступу до мапи пам’яті необхідно увімкнути служби мапи",
    "close": "Закрити"
  },
  "LoginRegistration": {
    "title": "Увійти або зареєструватись",
    "orInputEmail": "Або введіть вашу електронну пошту",
    "email": "Електронна пошта",
    "password": "Пароль",
    "repeat": "Повторіть пароль",
    "graduate": "Вітаємо з успішною реєстрацією!",
    "sendEmail": "Лист активації надіслано на",
    "via": "Через"
  },
  "errors": {
    "badRequest": "Неправильний запит",
    "notFound": "Ресурс не знайдено",
    "serverError": "Помилка сервера",
    "serviceUnavailable": "Сервіс тимчасово недоступний"
  },
  "InfoSource": {
    "title": "Як LocalHub збирає та використовує інформацію про місцевий бізнес?",
    "paragraph1": "Навіть якщо ви особисто не додавали інформацію про свій бізнес у LocalHub, він може вже бути присутній на платформі. Нижче ми пояснюємо, чому так відбувається і звідки береться ця інформація.",
    "subTitle1": "Чому ми збираємо дані?",
    "paragraph2": "Наша мета — надати місцевим мешканцям та гостям громади максимально повну та актуальну інформацію про послуги, підприємців, майстрів і виробників у їхньому місті. Щоб цього досягти, LocalHub регулярно оновлює дані, використовуючи різні загальнодоступні джерела.",
    "subTitle2": "Які джерела ми використовуємо?",
    "paragraph3": "Загальнодоступні джерела це відкрита та публічна інформація, поширення якої не обмежене законодавством України. Відповідно до Закону України «Про інформацію», масова інформація — це відомості, призначені для необмеженого кола осіб. Тобто, якщо назва вашої компанії, сфера діяльності, графік роботи, контакти чи інші дані вказані на вивісці, сайті, у рекламних матеріалах — LocalHub має право їх відтворювати.",
    "subTitle3": "Якщо ви хочете змінити або видалити дані",
    "paragraph4": "Якщо певна інформація про ваш бізнес розміщена помилково або з будь-якої іншої законної причини має бути видалена — ви можете надіслати запит через форму зворотного зв’язку на LocalHub. Ми обов’язково його розглянемо.",
    "paragraph5": "Для детальнішого ознайомлення з тим, як ми працюємо з персональними даними у контексті бізнес-профілів, перегляньте нашу ",
    "listItem1": "Загальнодоступні матеріали: офіційний сайт компанії, вітрини, рекламні флаєри, прайси тощо.",
    "listItem2": "Інформація від користувачів: наприклад, адреси, телефони, фотографії чи відгуки.",
    "listItem3": "Дані від власників бізнесу, які самостійно підтверджують та редагують свої сторінки."
  },
  "HowToAddInfo": {
    "title": "Як додати бізнес у LocalHub?",
    "subTitle1": "Що таке LocalHub?",
    "paragraph1": "Ми ретельно опрацьовуємо всі локації у місті та районі, щоб надати користувачу найактуальнішу інформацію.",
    "subTitle2": "Чим LocalHub корисний для бізнесу?",
    "paragraph2": "Ви отримаєте персональну веб сторінку із цінами, послугами та замовленням в один клік. Наша платформа побудована на найсучасніших технологіях та має всі інструменти просування в інтернеті, шарінгу через соціальні мережі та відслідковування просмотрів. Ваші клієнти більше не шукають «на вулиці» — вони шукають в інтернеті, і знайдуть саме вас.",
    "subTitle3": "Особливості LocalHub",
    "paragraph3": "Наш алгоритм ранжування враховує інтереси як користувачів, так і бізнесу. Це створює взаємовигідну екосистему для розвитку громади. Система відгуків та рейтингів стимулює бізнес бути привабливим, а користувачі усвідомлено обирають серед найкращих. Ми використовуємо найсучасніші технології, щоб звести більшість процесів до одного кліку.",
    "subTitle4": "Це платно?",
    "paragraph4": "Хочете ще більше клієнтів? Можна підключити додаткові платні послуги. Отримані кошти ми спрямовуємо на розвиток платформи та підтримку ВПО.",
    "subTitle5": "Наскільки це ефективно?",
    "callToAction": "Перейти до реєстрації",
    "contactUs": ["Є запитання?", "Напишіть нам — і ми з радістю допоможемо!"],
    "paragraph5": [" Два простих кроки:", "авторизуйтесь", "додайте компанію", "і", "отримайте нових клієнтів"],
    "paragraph6": " — це сервіс, який допомагає мешканцям знаходити потрібні послуги та товари поруч, а бізнесу — отримувати нових постійних клієнтів.",
    "paragraph7": [
      "Додати бізнес на LocalHub можна",
      "абсолютно безкоштовно",
      "Ви отримуєте рекламу та клієнтів без витрат."
    ],
    "paragraph8": [
      "Онлайн-реклама сьогодні — це найсильніший інструмент для малого та середнього бізнесу. LocalHub дозволяє таргетуватись навіть на рівні",
      "вулиці чи мікрорайону",
      ", що робить його унікальним рішенням. Забудьте про черги та великі витрати на рекламу в прохідних місцях. Ваша сторінка вже оптимізована для просування в інтернеті. Ви можете ділитись нею за коротким посиланням, а налаштовані метатегі все зроблять за вас. Наша площадка відкрита для замовлень ваших послуг та товарів 24/7, та не потребує витрат на підтримку роботи офісу або магазину"
    ]
  },
  "cookieSettings": "Налаштування cookies",
  "analytics": "Аналітика",
  "language": "Мова",
  "theme": "Тема",
  "cookiePreferences": "Налаштування cookies",
  "cookieInfo": "Статус cookies",
  "enabled": "Увімкнено",
  "disabled": "Вимкнено",
  "necessary": "Необхідні",
  "optional": "Опціональні"
}
